In [1]:
%pip install pandas
import pandas as pd
%load_ext sql

:

In [2]:
%%sql sqlite://
CREATE TABLE Sales (
    OrderID INT PRIMARY KEY,
    ProductName VARCHAR(50),
    Customer VARCHAR(50),
    OrderDate DATE,
    Quantity INT,
    UnitPrice INT
);
INSERT INTO Sales (OrderID, ProductName, Customer, OrderDate, Quantity, UnitPrice)
VALUES
    (1, 'Product A', 'David', '2024-01-05', 3, 25),
    (2, 'Product B', 'Bianca', '2024-01-10', 2, 30),
    (3, 'Product C', 'Leslie', '2024-01-15', 1, 15),
    (4, 'Product A', 'David', '2024-01-20', 4, 25),
    (5, 'Product D', 'Simon', '2024-01-25', 2, 50),
    (6, 'Product B', 'Bianca', '2024-02-01', 3, 30),
    (7, 'Product C', 'Simon', '2024-02-05', 1, 15),
    (8, 'Product A', 'Kean', '2024-02-10', 5, 25),
    (9, 'Product D', 'Kean', '2024-02-15', 2, 50),
    (10, 'Product B', 'Bianca', '2024-02-20', 2, 30);

Done.
10 rows affected.

[]

In [3]:
data = {
    'OrderID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'ProductName': ['Product A', 'Product B', 'Product C', 'Product A', 'Product D',
                    'Product B', 'Product C', 'Product A', 'Product D', 'Product B'],
    'Customer': ['David', 'Bianca', 'Leslie', 'David', 'Simon',
                     'Bianca', 'Simon', 'Kean', 'Kean', 'Bianca'],
    'OrderDate': ['2024-01-05', '2024-01-10', '2024-01-15', '2024-01-20', '2024-01-25',
                  '2024-02-01', '2024-02-05', '2024-02-10', '2024-02-15', '2024-02-20'],
    'Quantity': [3, 2, 1, 4, 2, 3, 1, 5, 2, 2],
    'UnitPrice': [25, 30, 15, 25, 50, 30, 15, 25, 50, 30]
}

# Create DataFrame
sales_data = pd.DataFrame(data)

In [4]:
#run this cell to see what the dataset looks like
sales_data

   OrderID ProductName Customer   OrderDate  Quantity  UnitPrice
0        1   Product A    David  2024-01-05         3         25
1        2   Product B   Bianca  2024-01-10         2         30
2        3   Product C   Leslie  2024-01-15         1         15
3        4   Product A    David  2024-01-20         4         25
4        5   Product D    Simon  2024-01-25         2         50
5        6   Product B   Bianca  2024-02-01         3         30
6        7   Product C    Simon  2024-02-05         1         15
7        8   Product A     Kean  2024-02-10         5         25
8        9   Product D     Kean  2024-02-15         2         50
9       10   Product B   Bianca  2024-02-20         2         30

- The name of the table is sales
- Always start your responses with this line `%%sql result <<`
- Then start writing your query on the next line for example
    ```
%%sql result <<
    select * from sales
    ```

#### 1. Retrieve all orders made by a customer named Bianca.
- Just use `*` to get all the column names
- clear everything in the cell below and write your sql query there. 
**Remember to Follow the Instructions on how to write your query**

In [5]:
%%sql result <<
select * 
from sales
where Customer = 'Bianca'

 * sqlite://
Done.
Returning data to local variable result

In [6]:
#Run this cell to check your output
print('This is the output of your query')
result.DataFrame()

This is the output of your query

   OrderID ProductName Customer   OrderDate  Quantity  UnitPrice
0        2   Product B   Bianca  2024-01-10         2         30
1        6   Product B   Bianca  2024-02-01         3         30
2       10   Product B   Bianca  2024-02-20         2         30

In [7]:
#Run this cell to see the expected output
test1 = sales_data[sales_data['Customer'] == 'Bianca'].reset_index(drop=True)
print('This is the expected output')
test1

This is the expected output

   OrderID ProductName Customer   OrderDate  Quantity  UnitPrice
0        2   Product B   Bianca  2024-01-10         2         30
1        6   Product B   Bianca  2024-02-01         3         30
2       10   Product B   Bianca  2024-02-20         2         30

In [8]:
assert result.DataFrame().equals(test1)

#### 2. Retrieve all products and the total qunatities sold for each product.
- Use the alias `total_quantity` for your aggregate column. Spell it exactly as i have written it.
- clear everything in the cell below and write your sql query there. 
**Remember to Follow the Instructions on how to write your query**

In [15]:
%%sql result <<
select ProductName, sum(Quantity) as total_quantity
from sales
group by ProductName

 * sqlite://
Done.
Returning data to local variable result

In [16]:
#Run this cell to check your output
print('This is the output of your query')
result.DataFrame()

This is the output of your query

  ProductName  total_quantity
0   Product A              12
1   Product B               7
2   Product C               2
3   Product D               4

In [17]:
#Run this cell to see the expected output
test2 = sales_data.groupby('ProductName')['Quantity'].sum().reset_index()
test2.columns = ['ProductName', 'total_quantity']
print('This is the expected output')
test2

This is the expected output

  ProductName  total_quantity
0   Product A              12
1   Product B               7
2   Product C               2
3   Product D               4

In [18]:
assert result.DataFrame().equals(test2)

#### 3. Write a query that Calculate the total quantity sold from sales in January 2024 only.
- Use the alias `total_quantity` for your aggregate column. Spell it exactly as i have written it.
- clear everything in the cell below and write your sql query there. 
**Remember to Follow the Instructions on how to write your query**

In [20]:
%%sql result <<
select sum(Quantity) as total_quantity
from sales
where OrderDate Like '2024-01%'

 * sqlite://
Done.
Returning data to local variable result

In [21]:
#Run this cell to check your output
print('This is the output of your query')
result.DataFrame()

This is the output of your query

   total_quantity
0              12

In [22]:
#Run this cell to see the expected output
jan_quantity = (sales_data[(sales_data['OrderDate'] >= '2024-01-01') & (sales_data['OrderDate'] <= '2024-01-31')]['Quantity'].sum())
test3 = pd.DataFrame([jan_quantity], columns = ['total_quantity'])
print('This is the expected output')
test3

This is the expected output

   total_quantity
0              12

In [23]:
assert result.DataFrame().equals(test3)

#### 4. Write a query that Calculates the average unit price sold.
- Use the alias `average_price` for your aggregate column. Spell it exactly as i have written it.
- clear everything in the cell below and write your sql query there. 
**Remember to Follow the Instructions on how to write your query**

In [24]:
%%sql result <<
select avg(UnitPrice) as average_price
from sales

 * sqlite://
Done.
Returning data to local variable result

In [25]:
#Run this cell to check your output
print('This is the output of your query')
result.DataFrame()

This is the output of your query

   average_price
0           29.5

In [26]:
#Run this cell to see the expected output
avgprc = sales_data['UnitPrice'].mean()
test4 = pd.DataFrame([avgprc], columns = ['average_price'])
print('This is the expected output')
test4

This is the expected output

   average_price
0           29.5

In [27]:
assert result.DataFrame().equals(test4)

#### 5. Retrieve a list of customers who made more than 2 orders.
- Use the alias `order_count` for your aggregate column. Spell it exactly as i have written it.
- clear everything in the cell below and write your sql query there. 
**Remember to Follow the Instructions on how to write your query**

In [33]:
%%sql result <<
SELECT Customer, COUNT(*) AS order_count
FROM sales
GROUP BY Customer
HAVING COUNT(*) > 2

 * sqlite://
Done.
Returning data to local variable result

In [34]:
#Run this cell to check your output
print('This is the output of your query')
result.DataFrame()

This is the output of your query

  Customer  order_count
0   Bianca            3

In [35]:
#Run this cell to see the expected output
test5 = (sales_data.groupby('Customer')
                                     .size()
                                     .reset_index(name='order_count')
                                     .query('order_count > 2'))
print('This is the expected output')
test5

This is the expected output

  Customer  order_count
0   Bianca            3

In [36]:
assert result.DataFrame().equals(test5)